&НаСервереБезКонтекста
Функция ПолучитьЗначениеСкидки(Ссылка)
	Возврат Ссылка.ПроцентСкидки;
КонецФункции

&НаКлиенте
Функция ПолучитьТекущиеДанные()
	Возврат Элементы.Товары.ТекущиеДанные;
КонецФункции

&НаКлиенте
Процедура РасчетСуммы()
	СтрокаРасчета = Элементы.Товары.ТекущиеДанные;
	ЗначениеСкидки = ПолучитьЗначениеСкидки(СтрокаРасчета.Скидка);
	// ЗначениеСкидки = СтрокаРасчета.Скидка.ПроцентСкидки;
	СтрокаРасчета.Сумма 		= СтрокаРасчета.Цена * СтрокаРасчета.Количество;
	СтрокаРасчета.СуммаСкидки 	= СтрокаРасчета.Сумма * ЗначениеСкидки * 0.01;
	СтрокаРасчета.Всего 		= СтрокаРасчета.Сумма - СтрокаРасчета.СуммаСкидки; 
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	РасчетСуммы()
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	РасчетСуммы()
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	РасчетСуммы()
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	ТекДанные = ПолучитьТекущиеДанные();
	ТекДанные.Цена = ТекДанные.Сумма / ТекДанные.Количество;
	
	Скидка = 10;
	
	ТекДанные.СуммаСкидки = Скидка * 0.01 * ТекДанные.Сумма;
	ТекДанные.Всего = ТекДанные.Сумма + ТекДанные.СуммаСкидки;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаСкидкиПриИзменении(Элемент)
	Скидка = 10;
	ТекДанные = ПолучитьТекущиеДанные();
	
	ТекДанные.Цена = ТекДанные.СуммаСкидки / ТекДанные.Количество * Скидка;
	ТекДанные.Сумма = ТекДанные.Количество * ТекДанные.Цена;
	ТекДанные.Всего = ТекДанные.Сумма + ТекДанные.СуммаСкидки;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВсегоПриИзменении(Элемент)
	Скидка = 10;
	ТекДанные = ПолучитьТекущиеДанные();
	
	ТекДанные.СуммаСкидки = ТекДанные.Всего / (Скидка + 100) * Скидка;
	
	ТекДанные.Сумма = (ТекДанные.Всего - ТекДанные.СуммаСкидки);
	ТекДанные.Цена = ТекДанные.Сумма / ТекДанные.Количество;
	
			
	
КонецПроцедуры
