&НаСервере
Функция ПолучитьЦену(НоменклатураДокумента)
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Контрагент",Объект.Контрагент);
	СтруктураОтбора.Вставить("Договор", Объект.Договор);
	СтруктураОтбора.Вставить("Номенклатура", НоменклатураДокумента);
	
	РезультатОтбора = РегистрыСведений.ЦеныПоставщиков.Получить(СтруктураОтбора);
	
	Возврат РезультатОтбора.Цена
КонецФункции

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	СтрокаРасчета = Элементы.Товары.ТекущиеДанные;
	СтрокаРасчета.Цена = ПолучитьЦену(СтрокаРасчета.Номенклатура);
	ТоварыЦенаПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	Данные = Элементы.Товары.ТекущиеДанные;
	Данные.Цена = Данные.Сумма / Данные.Количество;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	Данные = Элементы.Товары.ТекущиеДанные;
	Данные.Сумма = Данные.Количество * Данные.Цена;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	Данные = Элементы.Товары.ТекущиеДанные;
	Данные.Сумма = Данные.Количество * Данные.Цена;
КонецПроцедуры